In [1]:
%load_ext autoreload
%autoreload 2
from IPython.core.interactiveshell import InteractiveShell
from IPython.display import IFrame, display
InteractiveShell.ast_node_interactivity = "all"

# üßπCleaning cleaning functions

The company name cleaning function I've been working with explodes to 30GB in memory. It seriously shouldn't. Worth a refactor.

In [4]:
from src import locations as loc
from src.data import utils as du
from src.data.star import Star
from src.data.datasets import Dataset
from src.data.probabilities import Probabilities
from src.data.clusters import Clusters
from src.link.splink_linker import SplinkLinker
from src.config import link_pipeline, stopwords
from src.features.clean_complex import *
from src.features.clean_basic import *

import splink.duckdb.comparison_library as cl
import splink.duckdb.comparison_template_library as ctl

from dotenv import load_dotenv, find_dotenv
from pathlib import Path
import os
import duckdb
import pandas as pd

dotenv_path = find_dotenv()
load_dotenv(dotenv_path)

True

## Setup

Grab some data.

In [3]:
star = Star(
    schema = os.getenv("SCHEMA"),
    table = os.getenv("STAR_TABLE")
)
probabilities = Probabilities(
    schema = os.getenv("SCHEMA"),
    table = os.getenv("PROBABILITIES_TABLE"),
    star = star
)
clusters = Clusters(
    schema = os.getenv("SCHEMA"),
    table = os.getenv("CLUSTERS_TABLE"),
    star = star
)
# cl_x_exp=SplinkLinker.load(
#     path=Path(loc.DATA_SUBDIR['raw'], 'ch_x_exp.pickle')
# )

In [4]:
# cl_x_exp = SplinkLinker(
#     dataset = Dataset(
#         star_id=54717,
#         star=star
#     ), 
#     probabilities=probabilities, 
#     clusters=clusters, 
#     n=2
# )
# cl_x_exp.get_data(
#     cluster_select={
#         '"companieshouse"."companies"': [
#             "company_name as company_name",
#             "postcode as postcode"
#         ]
#     },
#     dim_select=[
#         "id",
#         "company_name",
#         "postcode"
#     ]
# )
# cl_x_exp.save(path=Path(loc.DATA_SUBDIR['raw'], 'ch_x_exp.pickle'))

In [5]:
# df = cl_x_exp.dim_raw.sample(int(1e4))
df = Dataset(
    selector=1970,
    star=star
).read_dim(sample=0.05)

/opt/conda/envs/company_matching/lib/python3.9/site-packages/pandas/io/sql.py:1410: RemovedIn20Warning: Deprecated API features detected! These feature(s) are not compatible with SQLAlchemy 2.0. To prevent incompatible upgrades prior to updating applications, ensure requirements files are pinned to "sqlalchemy<2.0". Set environment variable SQLALCHEMY_WARN_20=1 to show all deprecation warnings.  Set environment variable SQLALCHEMY_SILENCE_UBER_WARNING=1 to silence this message. (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  meta = MetaData(self.connectable, schema=schema)

In [4]:
# df = cl_x_exp.dim_raw.sample(int(1e4))
df_lrg = Dataset(
    selector=1970,
    star=star
).read_dim()

/opt/conda/envs/company_matching/lib/python3.9/site-packages/pandas/io/sql.py:1410: RemovedIn20Warning: Deprecated API features detected! These feature(s) are not compatible with SQLAlchemy 2.0. To prevent incompatible upgrades prior to updating applications, ensure requirements files are pinned to "sqlalchemy<2.0". Set environment variable SQLALCHEMY_WARN_20=1 to show all deprecation warnings.  Set environment variable SQLALCHEMY_SILENCE_UBER_WARNING=1 to silence this message. (Background on SQLAlchemy 2.0 at: https://sqlalche.me/e/b8d9)
  meta = MetaData(self.connectable, schema=schema)

In [6]:
df.sample(3)

,id,company_name,company_number,care_of,po_box,address_line_1,address_line_2,post_town,county,country,...,previous_name_7,previous_name_8_change_date,previous_name_8,previous_name_9_change_date,previous_name_9,previous_name_10_change_date,previous_name_10,conf_statement_next_due_date,conf_statement_last_made_up_date,publish_date
565,14509438,BROMPTON LODGE CARE LTD,14509438,,,132 BROMPTON LANE,,ROCHESTER,,ENGLAND,...,,,,,,,,11/12/2023,,2023-09-01
1896,08643687,LONGFORTH FARM MANAGEMENT COMPANY LIMITED,08643687,,,QUEENSWAY HOUSE,11 QUEENSWAY,NEW MILTON,HAMPSHIRE,ENGLAND,...,,,,,,,,05/08/2024,22/07/2023,2023-09-01
1061,NI691803,FAIRBURN FITNESS LTD,NI691803,,,"26 LINENHALL STREET, 1ST FLOOR",LINENHALL EXCHANGE,BELFAST,,NORTHERN IRELAND,...,,,,,,,,25/10/2023,,2023-09-01

## Unit test

Scratch for making one.

In [54]:
import ast

def load_test_data(path):
    dirty = pd.read_csv(
        Path(path, "dirty.csv"), 
        converters={"list": ast.literal_eval}
    )
    clean = pd.read_csv(
        Path(path, "clean.csv"), 
        converters={"list": ast.literal_eval}
    )
    dirty.columns = ["col"]
    clean.columns = ["col"]

    return dirty, clean

array_except_partial = partial(array_except, terms_to_remove=["ltd", "plc"])

dirty, clean = load_test_data(
    Path(loc.PROJECT_DIR, "test", "features", "expand_abbreviations")
)

In [66]:
def expand_abbreviations(input_column, replacements):
    """
    Expand abbreviations passed as a dictionary where the keys are matches
    and the values are what to replace them with.

    Matches only when term is surrounded by regex word boundaries.
    
    Arguments: 
        input_column: the name of the column to clean
        replacements: a dictionary where keys are matches and values are
        what the replace them with
        
    Returns: string to insert into SQL query
    """
    replace_stack = ""
    for i, (match, replacement) in enumerate(replacements.items()):
        if i == 0:        
            replace_stack = rf"""
                regexp_replace(
                    lower({input_column}),
                    '\b({match})\b',
                    '{replacement}',
                    'g'
                )
            """
        else:
            replace_stack = rf"""
                regexp_replace(
                    {replace_stack},
                    '\b({match})\b',
                    '{replacement}',
                    'g'
                )
            """
    
    return replace_stack

In [69]:
expand_abbreviations_partial = partial(
    expand_abbreviations,
    replacements = {
        "co": "company",
        "ltd": "limited",
        "baz": "bazinga"
    }
)

In [70]:
duckdb.sql(rf"""
    select
         {expand_abbreviations_partial("col")} as col
    from
        dirty
""")

‚îå‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îê
‚îÇ           col           ‚îÇ
‚îÇ         varchar         ‚îÇ
‚îú‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î§
‚îÇ foo company             ‚îÇ
‚îÇ bar company inc         ‚îÇ
‚îÇ bazinga company company ‚îÇ
‚îÇ quxco                   ‚îÇ
‚îÇ quux limited company    ‚îÇ
‚îÇ ltdcorge                ‚îÇ
‚îî‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îò

In [60]:
duckdb.sql(rf"""
    select
        regexp_replace(
            lower("col"),
            '(co\s|co$)',
            'company ',
            'g'
        ) as col
    from
        dirty
""")

‚îå‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îê
‚îÇ         col          ‚îÇ
‚îÇ       varchar        ‚îÇ
‚îú‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î§
‚îÇ foo company          ‚îÇ
‚îÇ bar company inc      ‚îÇ
‚îÇ baz company company  ‚îÇ
‚îÇ quxcompany           ‚îÇ
‚îÇ quux ltd company     ‚îÇ
‚îÇ ltdcorge             ‚îÇ
‚îî‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îò

## Pipeline

Testing how we can make stuff using the duckdb factory, and therefore unit testing only the basic versions of functions.

In [5]:
df_lrg = duckdb.sql("""
    select
        company_name, 
        [company_name[:10], company_name[10:]] as secondary_names,
        company_number
    from
        df_lrg
""").df()

In [6]:
df_lrg.sample(5)

,company_name,secondary_names,company_number
3597888,P AND A HODGES LIMITED,"[P AND A HO, ODGES LIMITED]",07133996
1448594,DRIP N DRY LTD,"[DRIP N DRY, Y LTD]",13345001
750611,BRAMWELL BROWN LIMITED,"[BRAMWELL B, BROWN LIMITED]",08504514
4780078,THE GREEN ROOM BOUTIQUE LIMITED,"[THE GREEN , ROOM BOUTIQUE LIMITED]",13658823
1988230,GMTK MANAGEMENT LTD,"[GMTK MANAG, GEMENT LTD]",09662611

In [7]:
%%time
clean_comp_names(df_lrg, "company_name", "secondary_names")

CPU times: user 13min 43s, sys: 8.26 s, total: 13min 51s
Wall time: 6min 24s

                company_name company_number           secondary_names
0                    goberub       13404790         [goberub l, None]
1        nspired investments       SC606050  [nspired i, investments]
2             nvertd designs       09152972       [nvertd de, esigns]
3                  yozo fass       02714021            [yozo fass, s]
4                     bora 2       13220580               [bora 2, 2]
...                      ...            ...                       ...
5393601                zeenu       14458541        [zeenu limi, ited]
5393602  zeeshan shafqat 799       14816987  [zeeshan sh, hafqat 799]
5393603              zeestar       12600587      [zeestar li, imited]
5393604                zeezo       14364849        [zeezo limi, ited]
5393605               zegura       11782185               [zegura, d]

[5393606 rows x 3 columns]

In [32]:
unnest = duckdb.sql(f"""
select
    row_number() over () as nest_id,
    *
    replace (unnest(secondary_names) as secondary_names)
from
    df2;
""").df()
unnest.head(5)

   nest_id           company_name secondary_names company_number
0        1   5 DAY BLINDS LIMITED      5 DAY BLIN       08294716
1        1   5 DAY BLINDS LIMITED     NDS LIMITED       08294716
2        2         5 DE PARYS LTD      5 DE PARYS       08046339
3        2         5 DE PARYS LTD           S LTD       08046339
4        3  5 DE VERE GARDENS LTD      5 DE VERE        13930524

In [33]:
processed = clean_primary(unnest, "company_name")
processed.head(5)

   nest_id       company_name secondary_names company_number
0        1       5 day blinds      5 DAY BLIN       08294716
1        1       5 day blinds     NDS LIMITED       08294716
2        2         5 de parys      5 DE PARYS       08046339
3        2         5 de parys           S LTD       08046339
4        3  5 de vere gardens      5 DE VERE        13930524

In [60]:
", ".join([f"any_value({col})" for col in processed.columns if col != 'nest_id'])

'any_value(company_name), any_value(secondary_names), any_value(company_number)'

In [61]:
duckdb.sql(f"""
select
    any_value(company_name), 
    any_value(company_number),
    list(secondary_names) as secondary_names
from
    unnest
group by nest_id;
""")

‚îå‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î¨‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î¨‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îê
‚îÇ       any_value(company_name)        ‚îÇ any_value(company_number) ‚îÇ                  secondary_names                  ‚îÇ
‚îÇ               varchar                ‚îÇ          varchar          ‚îÇ                     varchar[]                     ‚îÇ
‚îú‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îº‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îº‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î§
‚îÇ 5 DAY BLINDS LIMITED                 ‚îÇ 08294716                  ‚îÇ [5 DAY BLIN, NDS LIMITED]                         ‚îÇ
‚îÇ 5 DE PARYS LTD                       ‚îÇ 08046339                  ‚îÇ [5 DE PARYS, S LTD]                               ‚îÇ
‚îÇ 5 DE VERE GARDENS LTD                ‚îÇ 13930524                  ‚îÇ [5 DE VERE ,  GARDENS LTD]                        ‚îÇ
‚îÇ 5 DE VERE GARDENS MANAGEMENT COMPA‚Ä¶  ‚îÇ 02490721                  ‚îÇ [5 DE VERE ,  GARDENS MANAGEMENT COMPANY LIMITED] ‚îÇ
‚îÇ 5 DEEP LIMITED                       ‚îÇ 04190451                  ‚îÇ [5 DEEP LIM, MITED]                               ‚îÇ
‚îÇ 5 DEGREES FALMOUTH LIMITED           ‚îÇ 06902635                  ‚îÇ [5 DEGREES ,  FALMOUTH LIMITED]                   ‚îÇ
‚îÇ 5 DEGREES WEST MOTORBOAT TRAINING ‚Ä¶  ‚îÇ 10717438                  ‚îÇ [5 DEGREES ,  WEST MOTORBOAT TRAINING LTD]        ‚îÇ
‚îÇ 5 DEGREES WESTWARDS LTD              ‚îÇ 13171200                  ‚îÇ [5 DEGREES ,  WESTWARDS LTD]                      ‚îÇ
‚îÇ 5 DEMPSTER ROAD MANAGEMENT COMPANY‚Ä¶  ‚îÇ 04314012                  ‚îÇ [5 DEMPSTER, R ROAD MANAGEMENT COMPANY LIMITED]   ‚îÇ
‚îÇ 5 DENMARK TERRACE BRIGHTON LIMITED   ‚îÇ 03620115                  ‚îÇ [5 DENMARK ,  TERRACE BRIGHTON LIMITED]           ‚îÇ
‚îÇ      ¬∑                               ‚îÇ    ¬∑                      ‚îÇ         ¬∑                                         ‚îÇ
‚îÇ      ¬∑                               ‚îÇ    ¬∑                      ‚îÇ         ¬∑                                         ‚îÇ
‚îÇ      ¬∑                               ‚îÇ    ¬∑                      ‚îÇ         ¬∑                                         ‚îÇ
‚îÇ VOUTIQUE LTD                         ‚îÇ 07850974                  ‚îÇ [VOUTIQUE L, LTD]                                 ‚îÇ
‚îÇ NURSURYLAND(LONDON)LIMITED           ‚îÇ 00388419                  ‚îÇ [NURSURYLAN, ND(LONDON)LIMITED]                   ‚îÇ
‚îÇ S & K RETAIL LTD                     ‚îÇ 10119343                  ‚îÇ [S & K RETA, AIL LTD]                             ‚îÇ
‚îÇ SHALINI PRIVATE LIMITED              ‚îÇ 14225350                  ‚îÇ [SHALINI PR, RIVATE LIMITED]                      ‚îÇ
‚îÇ UE WILKES LTD                        ‚îÇ 13940041                  ‚îÇ [UE WILKES ,  LTD]                                ‚îÇ
‚îÇ S & K SCROWTHER LIMITED              ‚îÇ 04507842                  ‚îÇ [S & K SCRO, OWTHER LIMITED]                      ‚îÇ
‚îÇ QUBIS TECHNOLOGIES LTD               ‚îÇ 11708293                  ‚îÇ [QUBIS TECH, HNOLOGIES LTD]                       ‚îÇ
‚îÇ PETER BATTY PRODUCTIONS LIMITED      ‚îÇ 00964477                  ‚îÇ [PETER BATT, TY PRODUCTIONS LIMITED]              ‚îÇ
‚îÇ STOIQ LIMITED                        ‚îÇ 14503956                  ‚îÇ [STOIQ LIMI, ITED]                                ‚îÇ
‚îÇ STORM LEGAL LIMITED                  ‚îÇ 12481965                  ‚îÇ [STORM LEGA, AL LIMITED]                          ‚îÇ
‚îú‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î¥‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î¥‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î§
‚îÇ 2907 rows (20 shown)                                                                                       3 columns ‚îÇ
‚îî‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îò

In [37]:
renest = duckdb.sql(f"""
select
    *
    replace (list(secondary_names) as secondary_names)
from
    unnest
group by nest_id;
""").df()
renest.head(5)

ParserException: Parser Error: syntax error at or near "replace"
LINE 4:     replace (list(...
            ^

In [18]:
from functools import partial

remove_stopwords = partial(array_except, terms_to_remove=stopwords)

clean_primary = duckdb_cleaning_factory(
    [
        clean_company_name,
        remove_stopwords,
        list_join_to_string,
    ]
)
clean_secondary = unnest_renest(clean_primary)

In [19]:
clean_primary(df, "company_name").sample(3)

,id,company_name,company_number,care_of,po_box,address_line_1,address_line_2,post_town,county,country,...,previous_name_7,previous_name_8_change_date,previous_name_8,previous_name_9_change_date,previous_name_9,previous_name_10_change_date,previous_name_10,conf_statement_next_due_date,conf_statement_last_made_up_date,publish_date
1132,07661954,freddy foxtrots vintage emporium,07661954,,,18 TOP END,RENHOLD,BEDFORD,,ENGLAND,...,,,,,,,,22/06/2024,08/06/2023,2023-09-01
23,15023369,aaa gas engineers extensions,15023369,,,20 WENLOCK ROAD,,LONDON,,ENGLAND,...,,,,,,,,06/08/2024,,2023-09-01
1496,14512479,i security services i sec,14512479,,,46 HOUGHTON PLACE,,BRADFORD,WEST YORKSHIRE,UNITED KINGDOM,...,,,,,,,,12/12/2023,,2023-09-01

In [23]:
clean_secondary(df2, "secondary_names").sample(3)

,company_name,secondary_names,company_number
2783,SUNCH CONSULTING LTD,"[sunch cons, sulting]",14731169
1648,CUSTOM HOUSE FLATS MANAGEMENT COMPANY (ST IVES...,"[custom hou, use flats management st ives]",02547194
647,CORNELIUS CAPITAL LIMITED,"[cornelius, capital]",14645653

## Experiments

What does this function actually do?

* Standard clean of company name, returns tokens in an array
* Standard clean of an array of company's second names -- this as array of arrays, presumably
* Removes stopwords from the cleaned names
    * By joining in the stopwords to EVERY ROW
* Adds lists of terms removed etc (with pandas functions)

I think we can make it way more efficient by overwriting columns, keeping it in duckdb, and ditching columns that aren't needed in prod.

In [6]:
sec_df = duckdb.sql("""
    select
        *,
        [company_name, company_name] as secondary_names
    from
        df;
""").df()

In [10]:
def array_except(input_col_name, terms_to_remove):
    return rf"""
    array_filter(
        {input_col_name},
        x -> not array_contains({terms_to_remove}, x)
    )
    """

In [13]:
def array_except(input_col_name, terms_to_remove):
    return rf"""
    array_filter(
        {input_col_name},
        x -> not array_contains({terms_to_remove}, x)
    )
    """

def clean_comp_names(
    df, primary_col: str, secondary_col: str = None, stopwords: str = stopwords
):

    clean_and_stopwords_primary_sql = f"""
        select
            *
            replace (
                {list_join_to_string(
                    array_except(
                        clean_company_name(primary_col), 
                        stopwords
                    )
                )}
                as {primary_col}
            )
        from
            df;
    """
    
    if secondary_col is not None:
        unnest_sql = f"""
            select
                *
                replace (unnest({secondary_col}) as {secondary_col})
            from
                df;
        """
        clean_and_stopwords_secondary_sql = f"""
            select
                *
                replace (
                    {list_join_to_string(
                        array_except(
                            clean_company_name(secondary_col), 
                            stopwords
                        )
                    )}
                    as {secondary_col}
                )
            from
                df;
        """
        renest_sql = f"""
            select
                *
                replace (list({secondary_col}) as {secondary_col})
            from
                df
            group by all;
        """
        to_run = [
            unnest_sql, 
            clean_and_stopwords_secondary_sql,
            renest_sql,
            clean_and_stopwords_primary_sql
        ]
    else:
        to_run = [
            clean_and_stopwords_primary_sql
        ]

    for sql in to_run:
        df = duckdb.sql(sql).df()

    return df

In [15]:
clean_comp_names(
    df,
    primary_col="company_name",
    secondary_col=None,
    stopwords=stopwords
)

           id               company_name  postcode
0     1523028       gemini trading nottm  NG16 3SU
1     1029738            exel technology  NG18 5FU
2      898745           dominic schuster  GU21 2LX
3     2656450             ocompany tools   L33 7TW
4     3274294          montagne jeunesse  SA12 7AX
...       ...                        ...       ...
9995  1509290             radha supplies   SN4 0AW
9996  2423214        relay floor systems  WS13 6PY
9997  2011906  echo brand communications  BH21 7UH
9998  2857066         poclain hydraulics   PE8 4HN
9999   389039        edina manufacturing  BT28 2RE

[10000 rows x 3 columns]

In [16]:
clean_comp_names(
    sec_df,
    primary_col="company_name",
    secondary_col="secondary_names",
    stopwords=stopwords
)

,id,company_name,postcode,secondary_names
0,898745,dominic schuster,GU21 2LX,"[dominic schuster, dominic schuster]"
1,135087,partners design consultants,EC1M 6BM,"[partners design consultants, partners design ..."
2,133562,alliance wine,KA15 1LN,"[alliance wine, alliance wine]"
3,1770810,51parcel,E3 3QR,"[51parcel, 51parcel]"
4,2142513,babble cloud,EC3A 5AR,"[babble cloud, babble cloud]"
...,...,...,...,...
9995,2773496,am digital,WN6 9RD,"[am digital, am digital]"
9996,1970987,lewis antony richardcharles,NG18 4TW,"[lewis antony richardcharles, lewis antony ric..."
9997,983787,metocean telematics,PO15 7AB,"[metocean telematics, metocean telematics]"
9998,2689722,zakas dimitrios,AB10 1ZP,"[zakas dimitrios, zakas dimitrios]"
9999,1366131,west london nhs trust,UB2 4SA,"[west london nhs trust, west london nhs trust]"

In [18]:
cl_df = clean_comp_names(
    cl_x_exp.cluster_raw,
    primary_col="company_name",
    secondary_col=None,
    stopwords=stopwords
)

In [8]:
unnest = duckdb.sql(f"""
    select
        *
        replace (unnest(secondary_names) as secondary_names)
    from
        sec_df;
""").df()
unnest.head(5)

,id,company_name,postcode,secondary_names
0,1523028,GEMINI TRADING (NOTTM) LIMITED,NG16 3SU,GEMINI TRADING (NOTTM) LIMITED
1,1523028,GEMINI TRADING (NOTTM) LIMITED,NG16 3SU,GEMINI TRADING (NOTTM) LIMITED
2,1029738,EXEL TECHNOLOGY GROUP LTD,NG18 5FU,EXEL TECHNOLOGY GROUP LTD
3,1029738,EXEL TECHNOLOGY GROUP LTD,NG18 5FU,EXEL TECHNOLOGY GROUP LTD
4,898745,DOMINIC SCHUSTER LIMITED,GU21 2LX,DOMINIC SCHUSTER LIMITED

In [11]:
clean_and_stopwords_secondary = duckdb.sql(f"""
    select
        *
        replace (
            {list_join_to_string(
                array_except(
                    clean_company_name('secondary_names'), 
                    stopwords
                )
            )}
            as secondary_names
        )
    from
        unnest;
""").df()
clean_and_stopwords_secondary.head(5)

        id                    company_name  postcode       secondary_names
0  1523028  GEMINI TRADING (NOTTM) LIMITED  NG16 3SU  gemini trading nottm
1  1523028  GEMINI TRADING (NOTTM) LIMITED  NG16 3SU  gemini trading nottm
2  1029738       EXEL TECHNOLOGY GROUP LTD  NG18 5FU       exel technology
3  1029738       EXEL TECHNOLOGY GROUP LTD  NG18 5FU       exel technology
4   898745        DOMINIC SCHUSTER LIMITED  GU21 2LX      dominic schuster

In [12]:
renest = duckdb.sql(f"""
    select
        *
        replace (list(secondary_names) as secondary_names)
    from
        clean_and_stopwords_secondary
    group by all;
""").df()
renest.head(5)

,id,company_name,postcode,secondary_names
0,3274294,MONTAGNE JEUNESSE INTERNATIONAL LIMITED,SA12 7AX,"[montagne jeunesse, montagne jeunesse]"
1,2405408,ARMASHIELD LIMITED,PO7 7XJ,"[armashield, armashield]"
2,83891,MARINE AND CHARTER SOLUTIONS LLP,LL53 7AH,"[marine charter solutions, marine charter solu..."
3,1981031,TROUBADOR PUBLISHING LTD,LE8 0RX,"[troubador publishing, troubador publishing]"
4,2477306,J HEEBINK (MANCHESTER) LIMITED,M16 0RJ,"[j heebink manchester, j heebink manchester]"

In [9]:
primary_col = "company_name"
clean_primary_sql = f"""
    select
        *
        replace ({clean_company_name(primary_col)} as {primary_col})
    from
        to_process;
"""
stopwords_primary_sql = f"""
    select
        *
        replace (
            {list_join_to_string(
                array_except(
                    primary_col, 
                    stopwords
                )
            )}
            as {primary_col}
        )
    from
        to_process;
"""
to_do = [clean_primary_sql, stopwords_primary_sql]

In [ ]:
to_process = df
for i in to_do:
    to_process = duckdb.sql(i)

In [17]:
x1 = duckdb.sql(f"""
    select
        *,
        {clean_company_name("company_name")} as name_clean,
        {array_except("name_clean", stopwords)} as name_without_stopwords,
        {list_join_to_string("name_without_stopwords")} as name_out
    from
        df;
""")

In [20]:
duckdb.sql(f"""
    select
        * 
        exclude(name_clean, name_without_stopwords, name_out)
        replace(name_out as company_name)
    from
        x1;
""")

‚îå‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î¨‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î¨‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îê
‚îÇ   id    ‚îÇ        company_name         ‚îÇ postcode ‚îÇ
‚îÇ  int64  ‚îÇ           varchar           ‚îÇ varchar  ‚îÇ
‚îú‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îº‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îº‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î§
‚îÇ  258194 ‚îÇ shanti hospitality          ‚îÇ SW1P 2PN ‚îÇ
‚îÇ 2090119 ‚îÇ mywebtonet webhosting       ‚îÇ PO18 8EN ‚îÇ
‚îÇ 1568046 ‚îÇ medina spares               ‚îÇ BB7 1QD  ‚îÇ
‚îÇ 2983001 ‚îÇ astronova                   ‚îÇ SL6 3RT  ‚îÇ
‚îÇ  459540 ‚îÇ progressive motorsport      ‚îÇ NN13 7ES ‚îÇ
‚îÇ 3108194 ‚îÇ soltechsupply               ‚îÇ CV31 1LW ‚îÇ
‚îÇ 2572987 ‚îÇ cwt commodity logistics     ‚îÇ RM18 7EB ‚îÇ
‚îÇ 3362460 ‚îÇ western air ducts           ‚îÇ BA11 2FD ‚îÇ
‚îÇ 2461809 ‚îÇ anglo italian enterprises   ‚îÇ W1G 8NP  ‚îÇ
‚îÇ 1551069 ‚îÇ meir australia              ‚îÇ EC4V 4BE ‚îÇ
‚îÇ    ¬∑    ‚îÇ       ¬∑                     ‚îÇ    ¬∑     ‚îÇ
‚îÇ    ¬∑    ‚îÇ       ¬∑                     ‚îÇ    ¬∑     ‚îÇ
‚îÇ    ¬∑    ‚îÇ       ¬∑                     ‚îÇ    ¬∑     ‚îÇ
‚îÇ 3429276 ‚îÇ towerbrook capital partners ‚îÇ SW1Y 4AH ‚îÇ
‚îÇ 2782615 ‚îÇ transportify                ‚îÇ IP2 8LH  ‚îÇ
‚îÇ  239146 ‚îÇ schmitz cargobull           ‚îÇ WA4 4EZ  ‚îÇ
‚îÇ 1069547 ‚îÇ clive christian london      ‚îÇ SW1X 7XL ‚îÇ
‚îÇ 1180373 ‚îÇ gary brown                  ‚îÇ YO12 4PA ‚îÇ
‚îÇ  232102 ‚îÇ ancompany catalysts         ‚îÇ B61 7EP  ‚îÇ
‚îÇ 3208697 ‚îÇ brand way food              ‚îÇ NW10 7AE ‚îÇ
‚îÇ 1491296 ‚îÇ jo bird                     ‚îÇ TA9 4RN  ‚îÇ
‚îÇ 2039955 ‚îÇ gardline                    ‚îÇ NR30 3NG ‚îÇ
‚îÇ 1279838 ‚îÇ r m electrical              ‚îÇ SO19 2PB ‚îÇ
‚îú‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î¥‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î¥‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î§
‚îÇ ? rows (>9999 rows, 20 shown)          3 columns ‚îÇ
‚îî‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îò

In [39]:
sec_df2 = duckdb.sql(f"""
    select
        *
        replace (unnest(secondary_names) as secondary_names)
    from
        sec_df;
""")

In [40]:
sec_df3 = duckdb.sql(f"""
    select
        *
        replace ({clean_company_name("secondary_names")} as secondary_names)
    from
        sec_df2;
""")

In [43]:
sec_df4 = duckdb.sql(f"""
    select
        *
        replace (
            {
                list_join_to_string(
                    array_except("secondary_names", stopwords)
                )
            }
            as secondary_names
        )
    from
        sec_df3;
""")

In [50]:
sec_df5 = duckdb.sql(f"""
    select
        *
        replace (list(secondary_names) as secondary_names)
    from
        sec_df4
    group by all;
""")

In [5]:
def array_except(input_col_name, terms_to_remove):
    return rf"""
    array_filter(
        {input_col_name},
        x -> not array_contains({terms_to_remove}, x)
    )
    """

In [25]:
df2 = duckdb.sql(f"""
    select
        *
        replace ({clean_company_name("company_name")} as company_name)
    from
        df;
""")

In [11]:
df3 = duckdb.sql(f"""
    select
        *
        replace (
            {
                list_join_to_string(
                    array_except("company_name", stopwords)
                )
            }
            as company_name
        )
    from
        df2;
""")

In [9]:
df3

‚îå‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î¨‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î¨‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îê
‚îÇ   id    ‚îÇ                 company_name                 ‚îÇ postcode ‚îÇ
‚îÇ  int64  ‚îÇ                   varchar                    ‚îÇ varchar  ‚îÇ
‚îú‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îº‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îº‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î§
‚îÇ 2720694 ‚îÇ lloyd julian                                 ‚îÇ NR6 7GA  ‚îÇ
‚îÇ  647217 ‚îÇ niels larsen                                 ‚îÇ WF5 0HP  ‚îÇ
‚îÇ  505204 ‚îÇ churchill fire                               ‚îÇ EC2A 3QR ‚îÇ
‚îÇ  618395 ‚îÇ buzz pinky                                   ‚îÇ PO9 2NA  ‚îÇ
‚îÇ 3361781 ‚îÇ t f tull                                     ‚îÇ WD18 8RH ‚îÇ
‚îÇ  650314 ‚îÇ vct                                          ‚îÇ GU24 8HU ‚îÇ
‚îÇ 2310276 ‚îÇ showerdrape std                              ‚îÇ M17 1DB  ‚îÇ
‚îÇ  249534 ‚îÇ maquet                                       ‚îÇ NE35 9PZ ‚îÇ
‚îÇ 2321202 ‚îÇ fiera capital iom                            ‚îÇ IM1 1EU  ‚îÇ
‚îÇ 2893212 ‚îÇ nature s buddy                               ‚îÇ SW17 0QF ‚îÇ
‚îÇ    ¬∑    ‚îÇ       ¬∑                                      ‚îÇ    ¬∑     ‚îÇ
‚îÇ    ¬∑    ‚îÇ       ¬∑                                      ‚îÇ    ¬∑     ‚îÇ
‚îÇ    ¬∑    ‚îÇ       ¬∑                                      ‚îÇ    ¬∑     ‚îÇ
‚îÇ 1957717 ‚îÇ base childrenswear                           ‚îÇ IG8 8HF  ‚îÇ
‚îÇ   50716 ‚îÇ rascal clothing                              ‚îÇ EN11 0BE ‚îÇ
‚îÇ 2145000 ‚îÇ gw wines                                     ‚îÇ WA14 4QF ‚îÇ
‚îÇ 1754977 ‚îÇ jyw                                          ‚îÇ TA2 7AS  ‚îÇ
‚îÇ  891327 ‚îÇ digital print                                ‚îÇ NN7 2EG  ‚îÇ
‚îÇ 1624804 ‚îÇ lff scotland                                 ‚îÇ AB32 6JL ‚îÇ
‚îÇ 2628894 ‚îÇ dandara iom holdings                         ‚îÇ IM2 2SA  ‚îÇ
‚îÇ 1415928 ‚îÇ ecom                                         ‚îÇ BD10 9TQ ‚îÇ
‚îÇ 1701108 ‚îÇ shen zhen shi lang ma ke ji you xian gong si ‚îÇ AB10 1ZP ‚îÇ
‚îÇ 1109511 ‚îÇ millerbrown                                  ‚îÇ HD9 6EB  ‚îÇ
‚îú‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î¥‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î¥‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚î§
‚îÇ ? rows (>9999 rows, 20 shown)                           3 columns ‚îÇ
‚îî‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îÄ‚îò

In [ ]:
sql_clean_company_name = f"""
    select
        {clean_company_name(primary_col)} as company_name_arr,
        {
            f"{clean_company_name(secondary_col)} as secondary_names_arr, "
            if secondary_col
            else ""
        }
        *
    from df
"""
names_cleaned = duckdb.sql(sql_clean_company_name)

In [ ]:
"function": clean_comp_names,
"arguments": {
    "primary_col": "company_name",
    "secondary_col": None,
    "stopwords": stopwords,
},

In [ ]:
"function": clean_comp_names,
"arguments": {
    "primary_col": "company_name",
    "secondary_col": None,
    "stopwords": stopwords,
},

In [ ]:
def clean_comp_names(
    df, primary_col: str, secondary_col: str = None, stopwords: str = stopwords
):
    """
    Lower case, remove punctuation & tokenise the primary company name into an array.
    Extract tokens into: 'unusual' and 'stopwords'. Dedupe. Sort alphabetically.
    Untokenise the unusual words back to a string.

    Args:
        df: a dataframe
        primary_col: a column containing the company's main name
        secondary_col: a column containing an array of the company's
            secondary names
        stopwords: a list of stopwords to use for this clean
    Returns:
        dataframe: company number, 'unusual' tokens', most common 3 tokens,
            most common 4 to 6 tokens, list of previous names of company, postcode.
    """

    # TODO: Refactor the silly nested f-strings

    # CLEAN and TOKENISE
    # To a new dataframe
    sql_clean_company_name = f"""
    select
        {clean_company_name(primary_col)} as company_name_arr,
        {
            f"{clean_company_name(secondary_col)} as secondary_names_arr, "
            if secondary_col
            else ""
        }
        *
    from df
    """
    names_cleaned = duckdb.sql(sql_clean_company_name)  # noqa:F841

    # Define STOPWORDS
    # And join them in
    stopword_tokens = pd.DataFrame({"token_array": [stopwords]})  # noqa:F841
    sql_companies_arr_with_top = """
    select
        *,
        (select * from stopword_tokens) as stopwords
    from names_cleaned
    """
    with_common_terms = duckdb.sql(sql_companies_arr_with_top)  # noqa:F841

    # EXTRACT the UNUSUAL and STOPWORD tokens
    # We want the weird stuff from company names
    # TODO: leave name_unusual_tokens (and secondary...) as array & remove split() below
    def secondary_name_unusual_tokens():
        # DuckDB needs a refactor, sorry
        return list_join_to_string(array_except("secondary_names_arr", "stopwords"))

    def cat_names_tokens_stopwords(primary_arr, secondary_arr, stopwords):
        # DuckDB needs a refactor, sorry
        # return array_intersect("secondary_names_arr", "stopwords")
        primary = rf"{array_intersect(primary_arr, stopwords)}"
        secondary = rf"{array_intersect(primary_arr, stopwords)}"

        if secondary_arr:
            return rf"""
                array_cat(
                    {primary},
                    {secondary}
                )
            """
        else:
            return rf"{primary}"

    sql_manipulate_arrays = f"""
    select
        *,
        {
            list_join_to_string(
                array_except("company_name_arr", "stopwords")
            )
        }
            as name_unusual_tokens,
        {
            (
                f"{secondary_name_unusual_tokens()} "
                "as secondary_name_unusual_tokens"
            )
            if secondary_col
            else ""
        }
        {
            cat_names_tokens_stopwords(
                "company_name_arr",
                "secondary_names_arr",
                stopwords
            )
        } as names_tokens_stopwords
    from with_common_terms
    """
    clean = duckdb.sql(sql_manipulate_arrays)

    clean_df = clean.df()

    # DEDUPE names_tokens_stopwords
    clean_df["name_unusual_tokens"] = clean_df.name_unusual_tokens.apply(
        lambda x: " ".join(sorted(set(x.split()))) if pd.notnull(x) else x
    )
    if secondary_col:
        clean_df[
            "secondary_name_unusual_tokens"
        ] = clean_df.secondary_name_unusual_tokens.apply(
            lambda x: " ".join(sorted(set(x.split()))) if pd.notnull(x) else x
        )

    clean_df["names_tokens_stopwords"] = clean_df.names_tokens_stopwords.apply(
        lambda x: " ".join(set(x))
    )

    # Get HEAD and TAIL characters
    # For blocking rules
    clean_df["name_unusual_tokens_first5"] = clean_df.name_unusual_tokens.str[:5]
    clean_df["name_unusual_tokens_last5"] = clean_df.name_unusual_tokens.str[-5:]

    return clean_df